# Pandas

 * Name : Kshitij Kumar Sharma 
 * Roll No: 1905514
 * Date: 16/03/2022

In [4]:
import pandas as pd
import numpy as np

In [5]:
s=pd.Series([],dtype=int)
print(s)

Series([], dtype: int64)

In [6]:
data=pd.Series(['a','b','c','d']);
print(data)

0    a
1    b
2    c
3    d
dtype: object

In [7]:
s=pd.Series(['a','b','c','d'],index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [8]:
s=pd.Series([100,101,102,103],index=['a','b','c','d'])
print(s)

a    100
b    101
c    102
d    103
dtype: int64

In [11]:
data={
    'a':0,
    'b':1,
    'c':3
}
t=pd.Series(data,index=['a','b','c','d'])
print(t)

a    0.0
b    1.0
c    3.0
d    NaN
dtype: float64

In [12]:
r=pd.Series(5,index=[0,1,2,3,4])
r

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [13]:
p=pd.Series([1,2,3])
q=pd.Series([1,2,4])

In [14]:
u=p+q
u

0    2
1    4
2    7
dtype: int64

In [16]:
u=p*q
u

0     1
1     4
2    12
dtype: int64

In [18]:
s=pd.Series([1,2,3,4,5,6,7,8,9,10])
s.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
s.tail()

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
s.head(3)

0    1
1    2
2    3
dtype: int64

In [21]:
s.tail(3)

7     8
8     9
9    10
dtype: int64

In [22]:
s[:3]

0    1
1    2
2    3
dtype: int64

In [24]:
s[-3:]

7     8
8     9
9    10
dtype: int64

In [26]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])  
print (s[['c','d']])

c    3
d    4
dtype: int64

In [40]:
data1 = [1,2,3,4,5]
df1 = pd.DataFrame(data1)  
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [41]:
data1 = [['Freya',10],['Mohak',12],['Dwivedi',13]]
df1 = pd.DataFrame(data1,columns=['Name','Age'])
df1

      Name  Age
0    Freya   10
1    Mohak   12
2  Dwivedi   13

In [44]:
data1 = [['Freya',10],['Mohak',12],['Dwivedi',13]]
df1 = pd.DataFrame(data1,columns=['Name','Age'],dtype=float)
df1

/home/kshitij/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

      Name   Age
0    Freya  10.0
1    Mohak  12.0
2  Dwivedi  13.0

In [47]:
df1 = pd.DataFrame(data1, index=['rank1','rank2','rank3'])
df1

             0   1
rank1    Freya  10
rank2    Mohak  12
rank3  Dwivedi  13

In [48]:
data1 = [{'x': 1, 'y': 2},{'x': 5, 'y': 4, 'z': 5}]
df1 = pd.DataFrame(data1)  
print(df1)

   x  y    z
0  1  2  NaN
1  5  4  5.0

In [50]:
df = pd.DataFrame(data, index=['first', 'second'])
df

        a  b  c
first   0  1  3
second  0  1  3

In [52]:
d1 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}  
df1 = pd.DataFrame(d1)
df1

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [53]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
c = [7,8,9]
df['C'] = c
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [55]:
del df['A']
df

   B  C
0  4  7
1  5  8
2  6  9

In [56]:
df.pop('B')
df

   C
0  7
1  8
2  9

In [57]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
c = [7,8,9]
df

   A  B
0  1  4
1  2  5
2  3  6

In [58]:
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [60]:
d1 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}	
df1=pd.DataFrame(d1)
print (df1.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

In [62]:
d1 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}  
df1 = pd.DataFrame(d1)
print (df1.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

In [63]:
df1

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [66]:
df1=df1.drop('one',axis=1)
df1

   two
a    1
b    2
c    3
d    4

In [67]:
raw_data1 = {'name': ['freya', 'mohak'],'age': [10, 1],'favorite_color': ['pink', 'blue'],  'grade': [88, 92]}
df1 = pd.DataFrame(raw_data1, columns = ['name', 'age',  'favorite_color', 'grade'])
for index, row in df1.iterrows():
    print(row["name"], row["age"])

freya 10
mohak 1

In [70]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),  'Age':pd.Series([25,26,25,23,30,29,23]),  'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
df = pd.DataFrame(d)
print ("Our data frame is:")  
print (df) 
print ("The first two rows of the data frame is:")  
print (df.head(2))

Our data frame is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The first two rows of the data frame is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [72]:
df = pd.DataFrame(np.random.randn(8, 4),index = ['a','b','c','d','e','f','g','h'],columns = ['A', 'B', 'C', 'D'])
print(df.loc[:,'A'] )

a    0.660576
b    0.027935
c    0.553818
d   -0.223265
e    0.317967
f   -2.066457
g    0.311031
h   -0.639846
Name: A, dtype: float64

In [75]:
dict = {'name':['Mohak', 'Freya', 'Roshni'],'degree': ['MBA', 'BCA', 'M.Tech'],'score':[90, 40, 80]}
df = pd.DataFrame(dict, index = [True, False, True])  
print(df.loc[True])

        name  degree  score
True   Mohak     MBA     90
True  Roshni  M.Tech     80

In [76]:
x = pd.DataFrame({0: [1,2,3], 1: [4,5,6], 2: [7,8,9] })
y = pd.DataFrame({0: [1,2,3], 1: [4,5,6], 2: [7,8,9] })
new_x = x.add(y, axis=0)
print(new_x)

   0   1   2
0  2   8  14
1  4  10  16
2  6  12  18

In [78]:
left = pd.DataFrame({'id':[1,2],'Name': ['anil', 'vishal'],'subject_id':['sub1','sub2']})  
right = pd.DataFrame({'id':[1,2],'Name': ['sumer', 'salil'],'subject_id':['sub2','sub4']})
print (pd.merge(left,right,on='id'))
npd=pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    anil         sub1  sumer         sub2
1   2  vishal         sub2  salil         sub4

In [80]:
print("left join  ")
print()
print(pd.merge(left, right, on='subject_id', how='left')) #left join  
print()
print("right join ")
print()
print(pd.merge(left, right, on='subject_id', how='right')) #right join  
print()
print("outer join")
print()
print(pd.merge(left, right, how='outer', on='subject_id')) #outer join  
print()
print("inner join")
print()
print(pd.merge(left, right, on='subject_id', how='inner')) # inner join

left join

   id_x  Name_x subject_id  id_y Name_y
0     1    anil       sub1   NaN    NaN
1     2  vishal       sub2   1.0  sumer

right join

   id_x  Name_x subject_id  id_y Name_y
0   2.0  vishal       sub2     1  sumer
1   NaN     NaN       sub4     2  salil

outer join

   id_x  Name_x subject_id  id_y Name_y
0   1.0    anil       sub1   NaN    NaN
1   2.0  vishal       sub2   1.0  sumer
2   NaN     NaN       sub4   2.0  salil

inner join

   id_x  Name_x subject_id  id_y Name_y
0     2  vishal       sub2     1  sumer

In [82]:
data=pd.read_csv("test.csv")
data

      Name  Age
0      ram   20
1    rahul   30
2  kshitij   20

In [83]:
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],  'Price': [22000,25000,27000,35000]}
df = pd.DataFrame(cars, columns= ['Brand', 'Price'])
df.to_csv('export_dataframe.csv', index = False, header=True)